#ifndef MULTIPLECHOICEQUESTION_H

#define MULTIPLECHOICEQUESTION_H
#include "Question.h"

class MultipleChoiceQuestion : public virtual Question
{
	/*който представялва въпрос и няколко твърдения номерирани от 1 до n, от които някои са верни.
		Конструктора приема текст на въпроса, точки x, вектор с твърденията и булев вектор отбелязващ дали са верни или не.
		Ако твърденията са повече от размера на булевия вектор, допънителните твърдения да се игнорират.Ако булевия вектор е
		по - голям от броя на твърденията, допълните булеви стойности да се игнорират. (Ползвайте v.resize(необходимия размер))
		Всеки правилно посочен отговор добавя(x / брой верни) точки, а всеки погрешно посочен отговор отнема(x / брой грешни) точки.
		При задаване на въпроса се отпечатват текста, точките и твърденията, след това се отпечатват числата от 1 до n всяко на 
		нов ред и след всяко се изчаква студента да въведе "yes" или "no".*/

};

#endif // !MULTIPLECHOICEQUESTION_H
